Documents/ЗаказЗаявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ЗаказЗаявка</Name>
			<BasedOn>
				<xr:Item>Document.ЗаданиеНаДоставку</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>300</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаданиеНаДоставку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаданиеНаДоставку</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПогрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоГрузомест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъемГруза</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоподъемность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Вместимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветПеревозчика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагруженИзСтороннейБазы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Грузополучатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗаказЗаявка/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаданиеНаДоставку") Тогда	 
		
		Автомобиль = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения, "Автомобиль");
		
		Организация = Константы.ОсновнаяОрганизация.Получить();
		Контрагент = Автомобиль.ТранспортнаяКомпания;
		ДоговорКонтрагента = Документы.ЗаказЗаявка.ПолучитьДоговорПеревозчика(Контрагент);
		ЗаданиеНаДоставку = ДанныеЗаполнения; 
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		
		Автомобиль = ДанныеЗаполнения.Автомобиль;
		
		Организация = Константы.ОсновнаяОрганизация.Получить();
		Контрагент = Автомобиль.ТранспортнаяКомпания;
		ДоговорКонтрагента = Документы.ЗаказЗаявка.ПолучитьДоговорПеревозчика(Контрагент);
		ЗаданиеНаДоставку = ДанныеЗаполнения.ЗаданиеНаДоставку; 
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	Если Не ЗначениеЗаполнено(ЗаданиеНаДоставку) Тогда
		
		МассивРеквизитовПроверки = Новый Массив;
		МассивРеквизитовПроверки.Добавить("ТелефонКонтрагента");
		МассивРеквизитовПроверки.Добавить("ДатаПогрузки");
		МассивРеквизитовПроверки.Добавить("КоличествоГрузомест");
		МассивРеквизитовПроверки.Добавить("ВесГруза");
		МассивРеквизитовПроверки.Добавить("ОбъемГруза");
		МассивРеквизитовПроверки.Добавить("Грузоподъемность");
		МассивРеквизитовПроверки.Добавить("Вместимость");
		
		Для каждого Рекв Из МассивРеквизитовПроверки Цикл
			
			Если Не ЗначениеЗаполнено(ЭтотОбъект[Рекв]) Тогда
				
				Сообщить("Не заполнен реквизит: " + Рекв);
				Отказ = Истина;
				
			КонецЕсли;
			
		КонецЦикла; 
		
		Если Грузополучатели.Количество() = 0 Тогда
			
			Сообщить("Заполните грузополучателей");
			Отказ = Истина;
	
		КонецЕсли;
		
		
	КонецЕсли;

КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	
	ОтветПеревозчика = "";
	
КонецПроцедуры
